
base
#— минимальный набор пакетов, необходимых для базовой установки Arch Linux. Включает системные библиотеки и утилиты, ядро, менеджер пакетов pacman, системные службы и базовые инструменты командной строки.
base-devel

#— группа пакетов с инструментами для сборки программ из исходников, включая компиляторы (gcc), make, patch и другие утилиты. Не обязательна для обычного пользователя, но нужна для компиляции пакетов.
linux-zen
#— ядро Linux с патчами для повышения производительности и отзывчивости системы по сравнению со стандартным ядром.
linux-zen-headers
#— заголовочные файлы для ядра linux-zen, необходимые для компиляции драйверов и модулей ядра.
amd-ucode
#— микрокод процессоров AMD для исправления ошибок и повышения стабильности и безопасности системы.
networkmanager
#— служба для простого управления сетевыми подключениям (Wi-Fi, Ethernet, VPN и др.).
iwd
#— демон для управления беспроводными сетями, альтернативный wpa_supplicant.
wpa_supplicant
#— программное обеспечение для обеспечения безопасности беспроводных сетей WPA/WPA2.
network-manager-applet
#— графический апплет для панели рабочего стола, упрощающий управление NetworkManager.
pipewire
#— мультимедийный сервер для аудио и видео, альтернатива PulseAudio и JACK.
wireplumber
#— менеджер сессий для PipeWire, контролирует политику и управление потоками мультимедиа.
alsa-utils
#— утилиты для управления звуком через ALSA (Advanced Linux Sound Architecture).
pipewire-pulse
#— модуль PipeWire, обеспечивающий совместимость с PulseAudio API.
pipewire-alsa
#— модуль PipeWire, обеспечивающий совместимость с ALSA API.
hyprland
#— динамичный тайловый композитор Wayland, оконный менеджер для Wayland.
waybar
#— настраиваемая панель состояния для композиторов Wayland.
hyprlauncher
#— меню и лаунчер приложений для Wayland, аналог dmenu/rofi.
wl-clipboard
#- командные утилиты для управления буфером обмена в Wayland.
grim
#— утилита для снятия скриншотов в Wayland.
slurp
#— инструмент для выбора области экрана, часто используется совместно с grim.
kitty
#— GPU-ускоренный эмулятор терминала.
mako
#— легковесный демон уведомлений для Wayland.
xdg-utils
#— набор утилит для интеграции приложений с рабочим столом (запуск URL, файлов и т.п.).
xdg-desktop-portal
#— сервис-портал для безопасного доступа из изолированных приложений к функциям рабочего стола.
xdg-desktop-portal-wlr
#— реализация портала для композиторов Wayland на базе wlroots.
xdg-desktop-portal-hyprland
#— реализация портала, специфичная для Hyprland.
polkit
#— служба для централизованного управления правами доступа и привилегиями в системе.
polkit-gnome
#— агент аутентификации для polkit в окружении GNOME.
# brightnessctl
#— утилита командной строки для управления яркостью подсветки экрана.

usb_modeswitch
#— утилита для переключения некоторых USB-устройств из режима хранения в режим модема.
egl-wayland
#— поддержка EGL под Wayland для рендеринга OpenGL ES.
libva-nvidia-driver
#— драйвер VA-API для аппаратного ускорения видеодекодирования на видеокартах NVIDIA.
pavucontrol
ttf-jetbrains-mono-nerd
hyprlock
nwg-look
qt6ct
fzf
python-pywal
code
xdg-user-dirs
otf-font-awesome
hyprpaper
libreoffice-still
libreoffice-still-ru
gimp
gdb
clang
thunar
thunar-volman
thunar-archive-plugin
thunar-media-tags-plugin
gvfs
tumbler
fastfetch
noto-fonts-emoji
noto-fonts-cjk







# //выполнить
# xdg-user-dirs-update
# chsh -s /usr/bin/fish
# set -U fish_greeting
# sudo gpasswd -a $USER video
# sudo usermod -aG input $USER